Revit 2027 API
FabricationSaveJobOptions.AddHolesForTaps Property
 Set true to have holes for taps on straights added to the created fabrication job.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AddHolesForTaps { get; set; }
Public Property AddHolesForTaps As Boolean
	Get
	Set
public:
property bool AddHolesForTaps {
	bool get ();
	void set (bool value);
}
member AddHolesForTaps : bool with get, set
Property Value
Boolean
See Also
Reference
FabricationSaveJobOptions Class
Autodesk.Revit.DB.Fabrication Namespace